Revit 2027 API
Material.SurfaceBackgroundPatternColor Property
 The color of the material surface background pattern.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Color SurfaceBackgroundPatternColor { get; set; }
Public Property SurfaceBackgroundPatternColor As Color
	Get
	Set
public:
property Color^ SurfaceBackgroundPatternColor {
	Color^ get ();
	void set (Color^ value);
}
member SurfaceBackgroundPatternColor : Color with get, set
Property Value
Color
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
Material Class
Autodesk.Revit.DB Namespace